[
  {
    "continent": "Asia",
    "image": "images/South.svg",
    "description": "Asia is the largest and most populous continent on Earth, covering about 30% of the world’s land area and home to over half of the global population. It is bordered by Europe and Africa to the west, the Pacific Ocean to the east, the Arctic Ocean to the north, and the Indian Ocean to the south. Asia is known for its vast diversity in cultures, languages, religions, and landscapes—from the deserts of the Middle East and the mountains of the Himalayas to the tropical rainforests of Southeast Asia. It is also a center of ancient civilizations and modern economic powerhouses, blending tradition and innovation across its many regions.",
    "countries": [
      {
        "country": "Japan",
        "description": "",
        "image": "images/japan.jpg",
        "cities": [
          {
            "id": 1,
            "name": "Tokyo",
            "address": "Tokyo, Japan",
            "image": "images/japan.jpg",
            "population": "14 million",
            "description": "Tokyo, Japan’s bustling capital, blends ancient traditions with cutting-edge modernity. Skyscrapers, anime culture, Michelin-star dining, and centuries-old temples coexist harmoniously. The city offers a glimpse of both futuristic innovation and timeless Japanese culture—from the busy Shibuya Crossing to the calm of Meiji Shrine.",
            "carousel": [
              "images/fuj.jpg",
              "images/food.jpg",
              "images/japense-project.jpg"
            ],
            "touristSpots": [
              {
                "name": "Tokyo Tower",
                "image": "images/japan.jpg",
                "description": "An iconic red-and-white tower offering stunning views of Tokyo's skyline.",
                "details": {
                  "history": "Built in 1958, Tokyo Tower symbolizes Japan’s post-war rebirth and modernization. Inspired by the Eiffel Tower, it served as the main television broadcasting antenna for decades and became an iconic part of Tokyo’s skyline.",
                  "info": "Standing at 333 meters, the tower offers panoramic views of the city, including Mount Fuji on clear days. Visitors can explore observation decks, souvenir shops, and the One Piece anime theme park at its base."
                }
              },
              {
                "name": "Senso-ji Temple",
                "image": "/mages/korea.jpg",
                "description": "Tokyo’s oldest Buddhist temple, located in Asakusa.",
                "details": {
                  "history": "Senso-ji, founded in 645 AD, is Tokyo’s oldest Buddhist temple located in Asakusa. Legend says two fishermen discovered a statue of the goddess Kannon in the Sumida River, prompting the temple’s construction.",
                  "info": "The temple is known for its massive Thunder Gate (Kaminarimon) and bustling Nakamise shopping street leading to the main hall. It’s a spiritual hub surrounded by traditional stores selling snacks and souvenirs."
                }
              }
            ],
            "Foods": [
              {
                "FoodName": "Ramen",
                "About": "Tokyo-style ramen is a soy sauce-based noodle soup with clear broth made from chicken or pork bones. It’s light yet flavorful, often topped with sliced pork, seaweed, and green onions.",
                "Location": "You can find top ramen spots across Tokyo, especially in Shinjuku and Ikebukuro. Ichiran Ramen and Afuri are popular choices known for their aromatic and customizable bowls.",
                "Image": "images/takoks.png"
              },
              {
                "FoodName": "Sushi",
                "About": "Tokyo, once called Edo, is the birthplace of Edo-style (nigiri) sushi—hand-pressed rice topped with fresh fish. It’s considered a symbol of Japanese culinary precision and simplicity.",
                "Location": "Head to Tsukiji Outer Market or upscale sushi bars like Sukiyabashi Jiro in Ginza. Conveyor-belt sushi (kaiten-zushi) shops offer more casual yet delicious options for all budgets.",
                "Image": "images/jp.jpg"
              }
            ],
            "Activities": [
              {
                "name": "Cherry Viewing",
                "description": "Over 1,000 cherry trees line the park’s walkways. Locals and tourists gather under the blossoms to picnic and celebrate. The park also houses museums and Ueno Zoo, making it ideal for a full-day outing during the sakura season.The tranquil scenery and festive mood make it a peaceful yet lively cultural experience. ",
                "location": "Ueno, Taito Ward, Tokyo",
                "duration": "Half-day tour (8 AM – 12 PM)",
                "price": "Free",
                "Image": "images/jp.jpg",
                "inclusions": [
                  "Boat transfer",
                  "Local guide",
                  "Lunch",
                  "Snorkeling gear"
                ]
              },
              {
                "name": "Tokyo Skytree",
                "price": "¥2,000–¥3,000 (₱750–₱1,100)",
                "duration": "No Limit",
                "location": "Sumida, Tokyo",
                "ageRequirement": "12+",
                "description": "At 634 meters high, Tokyo Skytree offers observation decks, souvenir shops, and restaurants. It’s one of the city’s top landmarks for both sightseeing and relaxation.Climb Japan’s tallest structure for breathtaking views of the Tokyo skyline, Mount Fuji, and the city lights at night.",
                "Image": "/images/jp.jpg"
              }
            ],
            "reviews": [
              {
                "id": 1,
                "name": "Ron Weasley",
                "text": "Visiting this place was an unforgettable experience that truly captured the essence of its culture and beauty. The scenery was breathtaking, from the vibrant streets to the serene landscapes that offered moments of pure tranquility. Every detail, from the local cuisine to the friendly people, made the trip deeply enjoyable and memorable.",
                "rating": 5
              },
              {
                "id": 1,
                "name": "Harry Potter",
                "username": "John Doe",
                "text": "Great Place!",
                "rating": 3,
                "image": "https://api.dicebear.com/7.x/avataaars/svg?seed=John"
              }
            ]
          },
          {
            "id": 2,
            "name": "Kyoto",
            "address": "Kyoto, Japan",
            "image": "images/japan.jpg",
            "population": "14 million",
            "description": "Kyoto was the capital of Japan for more than a thousand years (from 794 to 1868) and remains the centre of traditional Japanese culture and Buddhism.",
            "carousel": [
              "images/fuj.jpg",
              "images/food.jpg",
              "images/japense-project.jpg"
            ],
            "touristSpots": [
              {
                "name": "Kinkaku‑ji",
                "image": "images/japan.jpg",
                "description": "An iconic red-and-white tower offering stunning views of Tokyo's skyline.",
                "details": {
                  "history": "Kinkaku‑ji (officially Rokuon‑ji) was founded in 1397 by the third shōgun of the Ashikaga shogunate, Ashikaga Yoshimitsu — it served as his retirement villa and later became a Zen Buddhist temple. The top two floors are covered in gold leaf, and the temple is part of the UNESCO “Historic Monuments of Ancient Kyoto",
                  "info": "The temple overlooks a pond in a classical strolling‑garden setting; the reflection of the golden structure in the water creates a serene, iconic image. Visitors walk a path around the pond, through pine‑trees and small pavilions, experiencing the layering of architecture, nature and water"
                }
              },
              {
                "name": "Osaka Castle",
                "image": "images/korea.jpg",
                "description": "Tokyo’s oldest Buddhist temple, located in Asakusa.",
                "details": {
                  "history": "Built in 1583 by the warlord Toyotomi Hideyoshi as a unifying stronghold of Japan, Osaka Castle witnessed sieges and destructions over centuries; the current main tower is a modern reconstruction housing a museum about the city and castle’s history.",
                  "info": "The castle sits in a large park area surrounded by stone walls and moats; inside the main tower (several floors) are exhibits of samurai armor, models and panoramic views of the city from the top floor. The surrounding grounds are especially scenic during cherry‑blossom season."
                }
              }
            ],
            "Foods": [
              {
                "FoodName": "Yudōfu",
                "About": "Yudōfu is a traditional Kyoto specialty, made from soft tofu simmered in a light kombu (kelp) broth. It is often served with dipping sauces like ponzu or sesame. The dish reflects Kyoto’s Buddhist culinary tradition, favors vegetarian and delicate flavors.",
                "Location": "Yudōfu is commonly found around temples such as Nanzen-ji or in the Philosopher’s Path area. Many small restaurants in these historic neighborhoods serve this comforting dish in a serene, traditional atmosphere.",
                "Image": "images/takoks.png"
              },
              {
                "FoodName": "Matcha",
                "About": "Kyoto is famous for its matcha (green tea), used in a wide variety of desserts such as matcha ice cream, cakes, and mochi. These sweets have a delicate bitterness balanced with sweet flavors, embodying Kyoto’s refined culinary culture",
                "Location": "Matcha sweets are available almost anywhere in Kyoto. But most local suggest tea houses in Gion or Uji, just outside Kyoto. Cafés along the streets near Kiyomizu-dera and in traditional wooden machiya houses also serve seasonal matcha desserts.",
                "Image": "images/jp.jpg"
              }
            ],
            "Activities": [
              {
                "name": "Tea Ceremony Experience",
                "description": "This activity offers visitors the chance to step back in time and experience an essential part of Japanese tradition. A tea master explains the meaning behind every motion, from the bowing to the way the matcha is served. It’s both meditative and cultural, providing a calm escape from the busy city.",
                "location": "Camellia Tea Ceremony, Gion District, Kyoto",
                "duration": "1 to 1.5 hours",
                "price": "¥3,000–¥6,000 per person (₱1,100–₱2,300)",
                "Image": "images/jp.jpg"
              },
              {
                "name": "Kimono Wearing",
                "duration": "1 to 2 hours",
                "price": "¥4,000–¥7,000 per person (₱1,500–₱2,600)",
                "location": "Higashiyama Ward, Kyoto",
                "description": "Participants can choose from a wide selection of colorful kimonos and accessories, with dressing assistance provided by professionals. Walking through Kiyomizu-dera Temple and Ninenzaka Street in a kimono gives visitors a true taste of old Kyoto life. Many rentals also include hairstyling and photo packages for a complete traditional experience.",
                "Image": "/images/jp.jpg"
              }
            ],
            "reviews": [
              {
                "id": 1,
                "name": "Ron Weasley",
                "text": "Visiting this place was an unforgettable experience that truly captured the essence of its culture and beauty. The scenery was breathtaking, from the vibrant streets to the serene landscapes that offered moments of pure tranquility. Every detail, from the local cuisine to the friendly people, made the trip deeply enjoyable and memorable.",
                "rating": 5
              },
              {
                "id": 1,
                "name": "Harry Potter",
                "username": "John Doe",
                "text": "Great Place!",
                "rating": 3,
                "image": "https://api.dicebear.com/7.x/avataaars/svg?seed=John"
              }
            ]
          }
        ]
      },
      {
        "country": "Philippines",
        "description": "",
        "image": "/images/korea.jpg",
        "cities": [
          {
            "id": 1,
            "name": "Manila",
            "address": "Manila, PH",
            "image": "images/japan.jpg",
            "population": "14 million",
            "description": "Manila, the capital of the Philippines, is a lively blend of history, culture, and urban energy. Once a Spanish colonial hub, the city now features towering skyscrapers beside centuries-old churches. Its bay sunsets, bustling streets, and rich food scene reflect the nation’s diverse heritage.",
            "carousel": [
              "images/fuj.jpg",
              "images/food.jpg",
              "images/japense-project.jpg"
            ],
            "touristSpots": [
              {
                "name": "Intramuros",
                "image": "images/japan.jpg",
                "details": {
                  "history": "Intramuros, known as the “Walled City,” was built by the Spanish in the late 1500s as the seat of government and religion during their colonial rule. Today, it stands as a historic landmark showcasing well-preserved architecture and a glimpse into Manila’s rich colonial past.",
                  "info": "Visitors can explore Fort Santiago, San Agustin Church, and cobblestone streets lined with heritage houses. Horse-drawn kalesas add to the old Manila atmosphere, offering a glimpse into the country’s colonial past. The area also features museums, cafes, and cultural exhibits that celebrate the Philippines’ vibrant history and resilience."
                }
              },
              {
                "name": "Rizal Park",
                "image": "/mages/korea.jpg",
                "description": "Tokyo’s oldest Buddhist temple, located in Asakusa.",
                "details": {
                  "history": "Also known as Luneta, a historic urban park honoring the Philippine national hero, Dr. José Rizal. Stroll through landscaped gardens, monuments, and open spaces while learning about the country’s struggle for independence.",
                  "info": "Rizal Park is located in Ermita, Manila. Here, visitors can walk through gardens, see monuments, and enjoy open spaces while learning about the nation’s history and culture. Cultural events and public gatherings are held regularly in the park."
                }
              }
            ],
            "Foods": [
              {
                "FoodName": "Adobo",
                "About": "Often considered the national dish, adobo is a flavorful stew made with pork or chicken simmered in soy sauce, vinegar, garlic, and peppercorns. Its rich, savory, and tangy taste makes it a staple on every Filipino table. Beloved across the country, adobo reflects the warmth and simplicity of Filipino home cooking.",
                "Location": "You can enjoy authentic adobo in local eateries across the Philippines, where each region adds its own twist. For a true Manila experience, visit Aristocrat along Roxas Boulevard, a long-time favorite of locals. Every bite captures the comforting and flavorful essence of traditional Filipino cuisine.",
                "Image": "images/takoks.png"
              },
              {
                "FoodName": "Halo-halo",
                "About": "A colorful shaved ice dessert layered with sweet beans, fruits, jellies, and leche flan. It’s topped with ice cream and evaporated milk, making it a refreshing treat perfect for Manila’s tropical heat. Every spoonful offers a blend of textures and flavors that represent the country’s diverse culinary culture.",
                "Location": "You can savor halo-halo at famous spots like Razon’s of Guagua or Chowking, but locals often recommend Aristocrat or MilkyWay Café in Makati for a more traditional version. These places serve halo-halo that perfectly balances sweetness and creaminess, making it a must-try dessert in Manila.",
                "Image": "images/jp.jpg"
              }
            ],
            "Activities": [
              {
                "name": "Intramuros Tour",
                "description": "Led by local guides, kalesa rides take visitors through Manila’s cobblestone streets, revealing the city’s rich history, colonial architecture, and stories of resilience. The slow-paced journey allows travelers to appreciate heritage houses and landmarks up close.",
                "location": "Intramuros, especially near Fort Santiago",
                "duration": "2 to 3 hours",
                "price": "₱500–₱1,000",
                "Image": "images/jp.jpg"
              },
              {
                "name": "Museum Visit",
                "price": "₱150–₱500",
                "duration": "1 to 2 hours",
                "location": "National Museum Complex, Ermita, Manila",
                "description": "Explore the National Museum of Fine Arts and Anthropology, home to Juan Luna’s famous Spoliarium and a rich collection of Filipino artifacts. Visitors can discover centuries of history, culture, and artistry that bring the nation’s story to life.",
                "Image": "/images/jp.jpg"
              }
            ],
            "reviews": [
              {
                "id": 1,
                "name": "Ron Weasley",
                "text": "Visiting this place was an unforgettable experience that truly captured the essence of its culture and beauty. The scenery was breathtaking, from the vibrant streets to the serene landscapes that offered moments of pure tranquility. Every detail, from the local cuisine to the friendly people, made the trip deeply enjoyable and memorable.",
                "rating": 5
              },
              {
                "id": 1,
                "name": "Harry Potter",
                "username": "John Doe",
                "text": "Great Place!",
                "rating": 3,
                "image": "https://api.dicebear.com/7.x/avataaars/svg?seed=John"
              }
            ]
          }
        ]
      },

      {
        "country": "South Korea",
        "description": "",
        "image": "images/japan.jpg",
        "cities": [
          {
            "id": 1,
            "name": "Seoul",
            "address": "Seoul, PH",
            "image": "images/japan.jpg",
            "population": "14 million",
            "description": "A dynamic city where modern skyscrapers meet historic palaces and traditional hanok villages. The city offers a unique mix of technology, fashion, nightlife, and cultural heritage, attracting travelers who want both history and urban excitement in one place.",
            "carousel": [
              "images/fuj.jpg",
              "images/food.jpg",
              "images/japense-project.jpg"
            ],
            "touristSpots": [
              {
                "name": "N Seoul Tower",
                "image": "images/japan.jpg",
                "details": {
                  "history": "Constructed in 1969, N Seoul Tower sits atop Namsan Mountain, offering panoramic views of the city. It has become an iconic symbol of Seoul and a popular destination for tourists and couples.",
                  "info": "The tower features observation decks, restaurants, and love locks, providing both sightseeing and dining experiences amid the cityscape. Visitors can also enjoy seasonal light displays and cultural events."
                }
              },
              {
                "name": "Gyeongbokgung",
                "image": "/mages/korea.jpg",
                "description": "Tokyo’s oldest Buddhist temple, located in Asakusa.",
                "details": {
                  "history": "Built in 1395 during the Joseon Dynasty, Gyeongbokgung was the main royal palace and symbol of Korean sovereignty. It was destroyed during invasions but later reconstructed, representing resilience and cultural pride.",
                  "info": "Visitors can explore the grand throne hall, gardens, and traditional pavilions. The ceremonial changing of the guard is performed daily in colorful attire. Walking through the courtyards and halls offers a glimpse into royal life and architecture."
                }
              }
            ],
            "Foods": [
              {
                "FoodName": "Bibimbap",
                "About": "Bibimbap is a rice dish topped with assorted vegetables, meat, and a fried egg, served with spicy gochujang sauce. It represents a harmonious balance of flavors and textures, central to Korean cuisine.",
                "Location": "Available in traditional restaurants across Seoul, especially in Insadong and Myeongdong, where locals and tourists enjoy authentic preparations and often paired with side dishes like kimchi.",
                "Image": "images/takoks.png"
              },
              {
                "FoodName": "Kimchi Stew",
                "About": "Kimchi jjigae is a spicy stew made with fermented cabbage, tofu, pork, and vegetables. It’s a staple comfort food that showcases Korea’s love for fermented flavors and hearty meals.",
                "Location": "Served in local eateries and traditional markets throughout Seoul, such as Gwangjang Market and Hongdae. Visitors can savor the dish while experiencing the vibrant atmosphere of these bustling neighborhoods.",
                "Image": "images/jp.jpg"
              }
            ],
            "Activities": [
              {
                "name": "Palace Tour",
                "description": "Guided tours provide historical context, allowing visitors to appreciate the intricate architecture, ceremonial performances, and beautiful palace gardens. Visitors also gain insights into the cultural significance and stories behind each landmark, deepening their understanding of local traditions.",
                "location": "Jongno-gu, Seoul",
                "duration": "2 to 3 hours",
                "price": "3,000 won – 10,000 won",
                "Image": "images/jp.jpg"
              },
              {
                "name": "Hanbok",
                "price": "10,000 won to 25,000 won",
                "duration": "1 to 2 hours",
                "location": "Gyeongbokgung & Bukchon Hanok Village",
                "description": "Dress in traditional Korean hanbok and stroll through palaces and cultural districts for photos and cultural immersion.Hanbok rentals include hairstyling and accessories. Walking in palaces and traditional villages gives a full cultural experience and memorable photo opportunities.",
                "Image": "/images/jp.jpg"
              }
            ],
            "reviews": [
              {
                "id": 1,
                "name": "Ron Weasley",
                "text": "Visiting this place was an unforgettable experience that truly captured the essence of its culture and beauty. The scenery was breathtaking, from the vibrant streets to the serene landscapes that offered moments of pure tranquility. Every detail, from the local cuisine to the friendly people, made the trip deeply enjoyable and memorable.",
                "rating": 5
              },
              {
                "id": 1,
                "name": "Harry Potter",
                "username": "John Doe",
                "text": "Great Place!",
                "rating": 3,
                "image": "https://api.dicebear.com/7.x/avataaars/svg?seed=John"
              }
            ]
          }
        ]
      }
    ]
  },
  {
    "continent": "Europe",
    "image": "/images/europe.svg",
    "description": "Europe is one of the seven continents, located entirely in the Northern Hemisphere and mostly in the Eastern Hemisphere. It is known for its rich history, diverse cultures, and significant influence on global politics, economy, art, and science. Europe is home to over 740 million people and comprises around 44 countries, including major ones like France, Germany, Italy, Spain, and the United Kingdom.",
    "countries": [
      {
        "country": "France",
        "description": "",
        "image": "/images/korea.jpg",
        "cities": [
          {
            "id": 1,
            "name": "Paris",
            "address": "Paris, France",
            "image": "images/japan.jpg",
            "population": "14 million",
            "description": "",
            "carousel": [
              "images/fuj.jpg",
              "images/food.jpg",
              "images/japense-project.jpg"
            ],
            "touristSpots": [
              {
                "name": "Eiffel Tower",
                "image": "images/japan.jpg",
                "details": {
                  "history": "Built in 1889 for the Exposition Universelle, the Eiffel Tower became a symbol of France and modern engineering. It was initially criticized but eventually won the hearts of locals and visitors alike.",
                  "info": "Visitors can take elevators or climb the stairs to observation decks offering panoramic views of Paris. The tower also features restaurants, souvenir shops, and night-time illuminations that attract millions every year."
                }
              },
              {
                "name": "Louvre Museum",
                "image": "/mages/korea.jpg",
                "description": "Tokyo’s oldest Buddhist temple, located in Asakusa.",
                "details": {
                  "history": "Originally a royal palace, the Louvre became a public museum in 1793, housing thousands of artworks, including the Mona Lisa and Venus de Milo. It has grown to be one of the largest and most visited museums in the world.",
                  "info": "Visitors can explore multiple galleries spanning centuries of art history, attend temporary exhibitions, and participate in guided tours. The Louvre blends history, art, and architecture in a unique and educational experience."
                }
              }
            ],
            "Foods": [
              {
                "FoodName": "Croissant",
                "About": "A classic French breakfast pastry, the croissant is buttery, flaky, and golden-brown. It represents the art of French baking and is enjoyed by locals and tourists alike. Freshly baked croissants are soft inside while crisp on the outside.",
                "Location": "Croissants can be found in boulangeries across Paris, especially in Le Marais and Saint-Germain-des-Prés. Local cafés often serve them with coffee for a traditional morning experience.",
                "Image": "images/takoks.png"
              },
              {
                "FoodName": "Coq au Vin",
                "About": "a traditional French dish where chicken is slowly braised in red wine with mushrooms, onions, and bacon. The slow cooking process allows the flavors to meld, producing a rich and hearty stew. It is often prepared for family gatherings and special occasions",
                "Location": "Restaurants such as Le Comptoir du Relais and Chez Dumonet serve authentic Coq au Vin. These establishments are known for maintaining traditional recipes that have been perfected over decades. Visitors can enjoy the dish with a glass of local wine to complement the flavors.",
                "Image": "images/jp.jpg"
              }
            ],
            "Activities": [
              {
                "name": "Louvre Tour",
                "description": "Explore thousands of artworks and artifacts in the Louvre Museum, discovering masterpieces spanning centuries. Guided or self-guided tours enhance understanding of the historical and cultural significance of the exhibits.",
                "location": "Rue de Rivoli, Paris",
                "duration": "2 to 4 hours",
                "price": "€15–€25",
                "Image": "images/jp.jpg"
              },
              {
                "name": "Tower Visit",
                "price": "€10–€25",
                "duration": "1 to 2 hours",
                "location": "Champ de Mars, Paris",
                "description": "Climb or take an elevator to the Eiffel Tower observation decks for panoramic views of Paris. The experience combines sightseeing with a touch of history and culture. Visitors can also dine or enjoy refreshments at the tower’s restaurants.",
                "Image": "/images/jp.jpg"
              }
            ],
            "reviews": [
              {
                "id": 1,
                "name": "Ron Weasley",
                "text": "Visiting this place was an unforgettable experience that truly captured the essence of its culture and beauty. The scenery was breathtaking, from the vibrant streets to the serene landscapes that offered moments of pure tranquility. Every detail, from the local cuisine to the friendly people, made the trip deeply enjoyable and memorable.",
                "rating": 5
              },
              {
                "id": 1,
                "name": "Harry Potter",
                "username": "John Doe",
                "text": "Great Place!",
                "rating": 3,
                "image": "https://api.dicebear.com/7.x/avataaars/svg?seed=John"
              }
            ]
          }
        ]
      },
      {
        "country": "Spain",
        "description": "",
        "image": "/images/korea.jpg",
        "cities": []
      }
    ]
  },

  {
    "continent": "Africa",
    "image": "/images/europe.svg",
    "description": "Africa is the second-largest continent in both area and population, located primarily in the Eastern Hemisphere and straddling the Equator. It is home to over 1.4 billion people and 54 recognized countries, each with distinct cultures, languages, and traditions. Africa is known for its diverse geography, ranging from vast deserts like the Sahara to lush rainforests, savannas, and mountain ranges such as Kilimanjaro. The continent has a rich history that includes ancient civilizations like Egypt, Carthage, and the Kingdom of Mali, which have contributed significantly to art, architecture, science, and trade.",
    "countries": [
      {
        "country": "Kenya",
        "description": "",
        "image": "/images/korea.jpg",
        "cities": [{}]
      },
      {
        "country": "Spain",
        "description": "France is famous for its cuisine, art, and the Eiffel Tower.",
        "image": "/images/korea.jpg",
        "cities": [{}]
      }
    ]
  },

  {
    "continent": "South-America",
    "image": "/images/europe.svg",
    "description": "South America is a continent located mostly in the Southern Hemisphere, bordered by the Atlantic Ocean to the east, the Pacific Ocean to the west, and connected to North America by the Isthmus of Panama. Major countries include Brazil, Argentina, Colombia, Peru, Chile, and Venezuela, each offering unique cultures, landscapes, and histories. The continent is known for its incredible natural diversity, from the Amazon rainforest and the Andes Mountains to the Pampas grasslands and Patagonia’s glaciers.",
    "countries": [
      {
        "country": "France",
        "description": "France is famous for its cuisine, art, and the Eiffel Tower.",
        "image": "/images/korea.jpg",
        "cities": [{}]
      },
      {
        "country": "Spain",
        "description": "France is famous for its cuisine, art, and the Eiffel Tower.",
        "image": "/images/korea.jpg",
        "cities": [{}]
      }
    ]
  },

  {
    "continent": "North-America",
    "image": "/images/europe.svg",
    "description": "North America is a continent in the Northern Hemisphere, bordered by the Arctic Ocean to the north, the Atlantic Ocean to the east, the Pacific Ocean to the west, and South America to the south. It includes major countries such as the United States, Canada, and Mexico, along with smaller nations in Central America and the Caribbean. The continent features diverse landscapes, including mountains, plains, deserts, forests, and extensive coastlines. Indigenous cultures have lived across North America for thousands of years, contributing unique traditions, languages, and art.",
    "countries": [
      {
        "country": "France",
        "description": "France is famous for its cuisine, art, and the Eiffel Tower.",
        "image": "/images/korea.jpg",
        "cities": [{}]
      },
      {
        "country": "Spain",
        "description": "France is famous for its cuisine, art, and the Eiffel Tower.",
        "image": "/images/korea.jpg",
        "cities": [{}]
      }
    ]
  },

  {
    "continent": "Australia",
    "image": "/images/europe.svg",
    "description": "Australia is both a country and a continent, located in the Southern Hemisphere between the Indian and Pacific Oceans. It is known for its vast landscapes, ranging from arid deserts in the Outback to tropical rainforests in the north and stunning coastlines along the Great Barrier Reef. Australia has a population of around 26 million people, with major cities like Sydney, Melbourne, Brisbane, and Perth serving as cultural and economic hubs. The continent is home to unique wildlife, including kangaroos, koalas, wombats, and the platypus, as well as diverse marine life along its coral reefs.",
    "countries": [
      {
        "country": "France",
        "description": "France is famous for its cuisine, art, and the Eiffel Tower.",
        "image": "/images/korea.jpg",
        "cities": [{}]
      },
      {
        "country": "Spain",
        "description": "France is famous for its cuisine, art, and the Eiffel Tower.",
        "image": "/images/korea.jpg",
        "cities": [{}]
      }
    ]
  }
]
